import 'package:FlutterSkolaDemo/lesson4/cars/Car.dart';

/// Урок 4: классы и перечисления
/// TODO сделать класс пример - животные. от него отнаследовать 2 класса кошки и собаки
/// TODO юзеру нужно сделать свой класс - машина и от него отнаследовать 3 типа разных машин
/// TODO придумать как минимум 7 заданий на работу с классам
/// Примеров в уроке -
/// Заданий в уроке -
/// Максимальное количество баллов =
/// Рекомендуемое количество баллов =
class Lesson4 {
  ///ПРИМЕРЫ:

  ///TODO примеры
  /// 1. Найти какое животное из списка съест всех
  /// 2. Найти всех черных животных\четвероногих\птиц и т.п
  /// 3. Посчитать общее количество ног в списке животных

}

///ЗАДАНИЯ:

///TODO задания
///1.Реализовать функции в Car
///2 Реализовать 2-3 машины Тесла, Лада и Рено
///3. Реализовать функцию подсчета сколько потребуется топлива
///и сколько оно будет стоить если ехать указаное кол-во времени при определенной цене топлива
///4.Найти самый быстрый автомобиль из списка
///